; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; FreeCellWorld
;;; Free cell game playing domain
;;;
;;; Description
;;; ------------
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13, and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;;
;;; The aim is to get all of the card home. 
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Cards are represented by the symbols 
;;;		ca, c2, ..., cj, cq, ck. - clubs
;;;		da, d2, ..., dj, dq, dk. - diamonds
;;;		ha, h2, ..., hj, hq, gk. - hearts
;;;		sa, s2, ..., sj, sq, sk. - spaces
;;;		(c0, d0, h0, s0 indicate an empty card of a certain suit).
;;; 
;;; Where:
;;;		c = clubs, d = diamonds, h = hearts, s = spades.
;;;		a = ace, j = jack, q = queen, k = king.
;;;
;;; Static Predicates (In Tlplan these were functions)
;;; 
;;; (value card val)   --- the face value of the card. (1, ..., 13)
;;; (suit card st)     --- the suit of the card. (c, d, h, s)
;;;   e.g., (value ca 1) (suit ca c)
;;; (successor n' n)   --- n' = n+1, for n=0,...,12, n'=1,...,13
;;;                        a cheap and dirty way to avoid using
;;;                        numbers. 
;;;                        Note 0 does not have a predecessor. This
;;;                        serves act as > 0 precondition
;;;
;;;
;;; Dynamic Predicates:
;;;
;;; (on card1 card2)	-- card1 is on card2
;;; (incell card)	--- card is in a freecell.
;;; (clear card)	--- card is clear (i.e., on top of a column).
;;; (cellspace n)	--- there are n free freecells.
;;;                                n = 0, 1, 2, 3, or 4
;;; (colspace n)	--- there are n free columns. n=0,..,8
;;; (home card)		--- card is a top card in a home stack.
;;;			    we use the special (home c0),
;;;			    (home d0), (home h0), (home s0).
;;;			    to indicate that home is empty for a
;;;			    particular suit.
;;; (bottomcol card)	--  card is at the bottom of a stack.
;;; (jokercard card)    -- the card is a joker card and thus can be added to the home colum if no
;;;						   other cards are on top of it based on its suite.
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :disjunctive-preconditions) 
  (:predicates (on ?c1 ?c2)
	       (incell ?c)
	       (clear ?c)
	       (cellspace ?n)
	       (colspace ?n)
	       (home ?c)
	       (bottomcol ?c)
	       (suit ?c ?s)
	       (value ?c ?v)
	       (successor ?n1 ?n0)
	       (jokercard ?c)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard)
	   :precondition (and (clear ?card) 
			      (clear ?newcard)
			      (on ?card ?oldcard))
	   :effect (and (on ?card ?newcard)
	   		(not (clear ?newcard))
			(clear ?oldcard)
			(not (on ?card ?oldcard))))

  (:action move-b
	   :parameters (?card ?newcard ?cols ?ncols)
	   :precondition (and (clear ?card) 
			      (bottomcol ?card)
			      (clear ?newcard)
			      (colspace ?cols)
			      (successor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree 
	   :parameters (?card ?oldcard ?cells ?ncells)
	   :precondition (and (clear ?card)
				(on ?card ?oldcard)
				(successor ?cells ?ncells)
				(cellspace ?cells))
	   :effect (and (incell ?card)
			(cellspace ?ncells)
			(clear ?oldcard)))

  (:action sendtofree-b 
	   :parameters (?card ?cells ?ncells ?cols ?ncols)
	   :precondition (and (clear ?card)
	   				(successor ?ncells ?cells)
					(successor ?ncols ?cols)
					(bottomcol ?card))
	   :effect (and (incell ?card)
			(cellspace ?ncells)
			(colspace ?ncols)))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard ?cols ?ncols)
	 :precondition (and (clear ?card)
	 		(on ?card ?oldcard)
	 		(colspace ?cols)
			(successor ?cols ?ncols))
	 :effect (and (clear ?oldcard)
	 		(clear ?card)
			(colspace ?ncols)
			(bottomcol ?card)))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard ?suit ?vcard ?homecard ?vhomecard)
	 :precondition (and
			(clear ?card) 
			(on ?card ?oldcard)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(or (successor ?vcard ?vhomecard)
				(jokercard ?card))
			(value ?homecard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
			  (not (home ?homecard))))

(:action sendtohome-b
	 :parameters (?card ?suit ?vcard ?homecard
			    ?vhomecard ?cols ?ncols)
	 :precondition (and 
	 			(clear ?card)
				(colspace ?cols)
				(bottomcol ?card)
				(home ?homecard)
				(suit ?card ?suit)
				(suit ?homecard ?suit)
				(value ?card ?vcard)
				(successor ?ncols ?cols)
				(or (successor ?vcard ?vhomecard)
					(jokercard ?card))
				(value ?homecard ?vhomecard))
	 :effect (and (home ?card)
	 			(colspace ?ncols)
				(not (home ?homecard))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card ?suit ?vcard
			    ?homecard ?vhomecard ?cells ?ncells)
    ;;Send a card home from a free cell.
	 :precondition (and 
	 			(clear ?card)
				(cellspace ?cells)
				(home ?homecard)
				(suit ?card ?suit)
				(suit ?homecard ?suit)
				(value ?card ?vcard)
				(or (successor ?vcard ?vhomecard)
					(jokercard ?card))
				(value ?homecard ?vhomecard)
				(successor ?cells ?ncells))
	 :effect (and (home ?card)
				(cellspace ?ncells)
				(clear ?card)
				(not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard ?cells ?ncells)
	 :precondition (and (incell ?card)
	 			(clear ?card)
				(clear ?newcard)
				(cellspace ?cells)
				(successor ?cells ?ncells))
	 :effect (and (clear ?card)
	 			(not (clear ?newcard))
				(on ?card ?newcard)
				(cellspace ?ncells)))

(:action newcolfromfreecell
	 :parameters (?card ?cols ?ncols ?cells ?ncells)
	 :precondition (and (incell ?card)
	 			(colspace ?cols)
				(cellspace ?cells)
				(successor ?cells ?ncells)
				(successor ?cols ?ncols))
	 :effect (and (bottomcol ?card)
	 			(clear ?card)
	 			(colspace ?ncols)
				(cellspace ?ncells))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; problem
(define (problem FreeCell2-4)
(:domain freecell)
(:objects
	diamond club heart spade 
	N0 N1 N2 N3 N4 
	spadeA
	diamondA
	club2
	heart2
	spade2
	heartA
	diamond2
	clubA
	diamond0
	club0
	heart0
	spade0
	
)
(:init
	(successor N1 N0)
	(successor N2 N1)
	(successor N3 N2)
	(successor N4 N3)
	(cellspace N2)
	(clear spadeA)
	(on spadeA spade2)
	(bottomcol spade2)
	(clear diamondA)
	(on diamondA heartA)
	(bottomcol heartA)
	(clear club2)
	(on club2 diamond2)
	(bottomcol diamond2)
	(clear heart2)
	(on heart2 clubA)
	(bottomcol clubA)
	(colspace N0)
	(value spadeA N1)
	(suit spadeA spade)
	(value diamondA N1)
	(suit diamondA diamond)
	(value club2 N2)
	(suit club2 club)
	(value heart2 N2)
	(suit heart2 heart)
	(value spade2 N2)
	(suit spade2 spade)
	(value heartA N1)
	(suit heartA heart)
	(value diamond2 N2)
	(suit diamond2 diamond)
	(value clubA N1)
	(suit clubA club)
	(home diamond0)
	(value diamond0 N0)
	(suit diamond0 diamond)
	(home club0)
	(value club0 N0)
	(suit club0 club)
	(home heart0)
	(value heart0 N0)
	(suit heart0 heart)
	(home spade0)
	(value spade0 N0)
	(suit spade0 spade)
)
(:goal (and
	(home diamond2)
	(home club2)
	(home heart2)
	(home spade2)
)))

; plan
1. (sendtohome diamonda hearta diamond n1 diamond0 n0)
   deleted: (on diamonda hearta) (home diamond0)
   added: (home diamonda) (clear hearta)
   goals met: 0 of 4
2. (sendtohome spadea spade2 spade n1 spade0 n0)
   deleted: (on spadea spade2) (home spade0)
   added: (home spadea) (clear spade2)
   goals met: 0 of 4
3. (sendtohome-b hearta heart n1 heart0 n0 n0 n1)
   deleted: (home heart0)
   added: (home hearta) (colspace n1)
   goals met: 0 of 4
4. (sendtonewcol club2 diamond2 n1 n0)
   added: (clear diamond2) (bottomcol club2)
   goals met: 0 of 4
5. (sendtonewcol heart2 cluba n1 n0)
   added: (clear cluba) (bottomcol heart2)
   goals met: 0 of 4
6. (sendtohome-b cluba club n1 club0 n0 n0 n1)
   deleted: (home club0)
   added: (home cluba)
   goals met: 0 of 4
7. (homefromfreecell club2 club n2 cluba n1 n2 n1)
   deleted: (home cluba)
   added: (home club2) (cellspace n1)
   goals met: 1 of 4
8. (homefromfreecell heart2 heart n2 hearta n1 n2 n1)
   deleted: (home hearta)
   added: (home heart2)
   goals met: 2 of 4
9. (sendtohome-b diamond2 diamond n2 diamonda n1 n0 n1)
   deleted: (home diamonda)
   added: (home diamond2)
   goals met: 3 of 4
10. (sendtohome-b spade2 spade n2 spadea n1 n0 n1)
   deleted: (home spadea)
   added: (home spade2)
   goals met: 4 of 4
